A2C/system/boundaryProbes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes out values of fields at a specified list of points, interpolated to
    specified boundary patches.

\*---------------------------------------------------------------------------*/

fields (p U);

points
(
    (0 0 0)
);

maxDistance 0.1;

patches     (".*");

#includeEtc "caseDicts/postProcessing/probes/boundaryProbes.cfg"

// ************************************************************************* //
