A2C/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     buoyantPimpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         3000;

deltaT          0.01;

writeControl    timeStep;

writeInterval   10000;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  no;

maxCo           0.5;

/*
libs
(
    "libfieldFunctionObjects.so"
    "libFVFunctionObjects.so"
);

functions
{
    volAvgT
    {
        type 			cellSource;
        fields			(T);
        valueOutput		false;
        source 			all;
        operation		volAverage;
        outputControl		outputTime;
        outputInterval		1;
    }
    probes	// point
    {
        type			probes;
        functionObjectLibs	("libsampling.so");
        enabled			true;
        outputControl		outputTime;
        outputInterval		1;
        probeLocations
        (
            ( 1.2 1.6 1.1 )
        );
        fields
        (
            U p T
        );
     }
    floor	// PatchName
    {
        type            faceSource;
        functionObjectLibs ("libfieldFunctionObjects.so");
        enabled         true;
        outputControl   outputTime;	// timeStep
        outputInterval  1;
        log             true;
        valueOutput     false;
        source          patch;
        sourceName      floor;		// PatchName
        operation       areaAverage;
        fields
        (
            T
        );
    }
    ceiling	// PatchName
    {
        type            faceSource;
        functionObjectLibs ("libfieldFunctionObjects.so");
        enabled         true;
        outputControl   outputTime;	// timeStep
        outputInterval  1;
        log             true;
        valueOutput     false;
        source          patch;
        sourceName      ceiling;	// PatchName
        operation       areaAverage;
        fields
        (
            T
        );
    }
    nWall	// PatchName
    {
        type            faceSource;
        functionObjectLibs ("libfieldFunctionObjects.so");
        enabled         true;
        outputControl   outputTime;	// timeStep
        outputInterval  1;
        log             true;
        valueOutput     false;
        source          patch;
        sourceName      ceiling;	// PatchName
        operation       areaAverage;
        fields
        (
            T
        );
    }
    sWall	// PatchName
    {
        type            faceSource;
        functionObjectLibs ("libfieldFunctionObjects.so");
        enabled         true;
        outputControl   outputTime;	// timeStep
        outputInterval  1;
        log             true;
        valueOutput     false;
        source          patch;
        sourceName      ceiling;	// PatchName
        operation       areaAverage;
        fields
        (
            T
        );
    }
    inlet	// PatchName
    {
        type            faceSource;
        functionObjectLibs ("libfieldFunctionObjects.so");
        enabled         true;
        outputControl   outputTime;	// timeStep
        outputInterval  1;
        log             true;
        valueOutput     false;
        source          patch;
        sourceName      ceiling;	// PatchName
        operation       areaAverage;
        fields
        (
            T
        );
    }
    outlet	// PatchName
    {
        type            faceSource;
        functionObjectLibs ("libfieldFunctionObjects.so");
        enabled         true;
        outputControl   outputTime;	// timeStep
        outputInterval  1;
        log             true;
        valueOutput     false;
        source          patch;
        sourceName      ceiling;	// PatchName
        operation       areaAverage;
        fields
        (
            T
        );
    }
}
*/
// ************************************************************************* //
