A2C/system/renumberMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    note        "mesh renumbering dictionary";
    object      renumberMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Write maps from renumbered back to original mesh
//番号を付け替えたマップを元のメッシュに書き戻す
writeMaps true;

// Optional entry: sort cells on coupled boundaries to last for use with
// e.g. nonBlockingGaussSeidel.
//オプションのエントリ：結合境界でセルを並べ替えて最後に使用する
//例えばnonBlockingGaussSeidel。
sortCoupledFaceCells false;

// Optional entry: renumber on a block-by-block basis. It uses a
// blockCoeffs dictionary to construct a decompositionMethod to do
// a block subdivision) and then applies the renumberMethod to each
// block in turn. This can be used in large cases to keep the blocks
// fitting in cache with all the cache misses bunched at the end.
// This number is the approximate size of the blocks - this gets converted
// to a number of blocks that is the input to the decomposition method.
// オプションのエントリ：ブロックごとに番号を付け直す。
// それはblockCoeffs辞書を使ってdecompositionMethodを構築します。
// ブロックの細分割）を実行してから、それぞれにrenumberMethodを適用します。
// 順番にブロックします。これはブロックを保持するために大規模な場合に使用することができます
// 最後にまとめられたすべてのキャッシュミスでキャッシュに収まります。
// この数はブロックのおおよそのサイズです - これは変換されます
// 分解方法への入力であるいくつかのブロックに。
//blockSize 1000;

// Optional entry: sort points into internal and boundary points
//任意入力：点を内部点と境界点に分類する
//orderPoints false;

// Optional: suppress renumbering cellSets,faceSets,pointSets
// オプション：cellSets、faceSets、pointSetsの番号変更を抑制
//renumberSets false;


method          CuthillMcKee;
//method          Sloan;
//method          manual;
//method          random;
//method          structured;
//method          spring;
//method          zoltan;             // only if compiled with zoltan support

//CuthillMcKeeCoeffs
//{
//    // Reverse CuthillMcKee (RCM) or plain
//    reverse true;
//}

manualCoeffs
{
    // In system directory: new-to-original (i.e. order) labelIOList
    dataFile "cellMap";
}


// For extruded (i.e. structured in one direction) meshes
//押し出された（つまり一方向に構造化された）メッシュの場合
structuredCoeffs
{
    // Patches that mesh was extruded from. These determine the starting
    //メッシュの押し出し元のパッチ。これらは開始を決定します
    // layer of cells
    patches (movingWall);
    // Method to renumber the starting layer of cells
    method  random;

    // Renumber in columns (depthFirst) or in layers
    depthFirst true;

    // Reverse ordering
    reverse false;
}


springCoeffs
{
    // Maximum jump of cell indices. Is fraction of number of cells
    maxCo 0.01;

    // Limit the amount of movement; the fraction maxCo gets decreased
    // with every iteration
    freezeFraction 0.999;

    // Maximum number of iterations
    maxIter 1000;
}


blockCoeffs
{
    method          scotch;
    // method hierarchical;
    // hierarchicalCoeffs
    //{
    //    n           (1 2 1);
    //    delta       0.001;
    //    order       xyz;
    //}
}


zoltanCoeffs
{
    ORDER_METHOD    LOCAL_HSFC;
}


// ************************************************************************* //
